import { create } from "zustand"

const useElementsStore = create((set) => ({
	verb: ["食べる", "飲む", "行く", "来る", "見る", "する", "話す", "書く", "読む", "寝る"],
	adjective: [
		"大きい",
		"小さい",
		"高い",
		"安い",
		"新しい",
		"古い",
		"いい",
		"悪い",
		"面白い",
		"忙しい",
	],
	noun: ["人", "本", "学校", "水", "食べ物", "日本", "車", "時間", "友達", "言葉"],
	prefix: [
		"お",
		"ご",
		"大",
		"小",
		"真",
		"新",
		"旧",
		"不",
		"無",
		"未",
		"再",
		"反",
		"前",
		"後",
		"最",
		"超",
		"極",
		"多",
		"少",
	],
	suffix: ["間", "中", "後", "前", "回"],
	particle: ["は", "が", "を", "に", "で", "の", "と", "も", "へ", "から"],
	ichidanConjugations: {
		default: ["ない", "たい", "られる", "させる", "ろ", "よう", "て", "た"],

		ない: ["く", "かった"],
		く: ["ない"],
		かった: [],

		たい: ["ない", "かった"],
		たく: ["ない"],
		たかった: [],

		られる: ["たい", "ない"],
		させる: ["られる", "たい", "ない"],

		れば: [],
		ろ: [],
		よう: [],
		て: [],
		た: [],
	},

	godanConjugations: {
		B1: ["ない", "れる", "せる", "ず"],
		B2: [],
		B3: [],
		B4: ["ば", "る"],
		B5: ["う"],
		Bte: ["て"],
		Bta: ["た"],
	},
	adjectiveConjugations: ["くない", "かった", "くなかった", "く"],
	punctuation: ["、", "。"],
	coupla: ["だ", "です"],
}))

export default useElementsStore
